### $ leverage terraform apply
```
[16:12:20]    INFO	Attempting to get temporary credentials for apps-devstg account.
[16:12:22]    INFO	Using already configured temporary credentials.
[16:12:22]    INFO	Attempting to get temporary credentials for shared account.
[16:12:24]    INFO	Using already configured temporary credentials.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_record.priv_oring_dev_aws_binbash_com_ar will be created
  + resource "aws_route53_record" "priv_oring_dev_aws_binbash_com_ar" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.devstg.aws.binbash.com.ar"
      + type            = "A"
      + zone_id         = "Z0XXXXXXXXXXXXXXXXPDJ"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.s3_origin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_origin"  {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin/*",
            ]
          + sid       = "S3GetObjectForCloudFront"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin",
            ]
          + sid       = "S3ListBucketForCloudFront"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.s3_ssl_only[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_ssl_only"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "ForceSSLOnlyAccess"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0] will be created
  + resource "aws_cloudfront_distribution" "default" {
      + aliases                        = [
          + "dev.devstg.aws.binbash.com.ar",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Managed by Terraform"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Environment" = "apps-devstg"
          + "Name"        = "devstg.aws.binbash.com.ar"
          + "Namespace"   = "bb-apps-devstg-frontend"
          + "Stage"       = "dev"
          + "Terraform"   = "true"
        }
      + tags_all                       = {
          + "Environment" = "apps-devstg"
          + "Name"        = "devstg.aws.binbash.com.ar"
          + "Namespace"   = "bb-apps-devstg-frontend"
          + "Stage"       = "dev"
          + "Terraform"   = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 60
          + max_ttl                = 15552000
          + min_ttl                = 0
          + target_origin_id       = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar"
          + trusted_key_groups     = []
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = "arn:aws:acm:us-east-1:52XXXXXXXXX4:certificate/52ed035XXXXXXXXXXXXXXXXe21774"
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1"
          + ssl_support_method             = "sni-only"
        }
    }

  # module.dev_aws_binbash_com_ar.aws_cloudfront_origin_access_identity.default[0] will be created
  + resource "aws_cloudfront_origin_access_identity" "default" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.dev_aws_binbash_com_ar.aws_s3_bucket.origin[0] will be created
  + resource "aws_s3_bucket" "origin" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Attributes"  = "origin"
          + "Environment" = "apps-devstg"
          + "Name"        = "devstg.aws.binbash.com.ar"
          + "Namespace"   = "bb-apps-devstg-frontend"
          + "Stage"       = "dev"
          + "Terraform"   = "true"
        }
      + tags_all                    = {
          + "Attributes"  = "origin"
          + "Environment" = "apps-devstg"
          + "Name"        = "devstg.aws.binbash.com.ar"
          + "Namespace"   = "bb-apps-devstg-frontend"
          + "Stage"       = "dev"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "dev.devstg.aws.binbash.com.ar",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3600
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.dev_aws_binbash_com_ar.aws_s3_bucket_ownership_controls.origin[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "origin" {
      + bucket = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.dev_aws_binbash_com_ar.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.dev_aws_binbash_com_ar.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
  + resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
      + create_duration  = "30s"
      + destroy_duration = "30s"
      + id               = (known after apply)
    }

  # module.dev_aws_binbash_com_ar.module.logs.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy"  {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)
    }

  # module.dev_aws_binbash_com_ar.module.logs.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "ForceSSLOnlyAccess"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket.default[0] will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Attributes"  = "logs"
          + "Environment" = "apps-devstg"
          + "Name"        = "devstg.aws.binbash.com.ar"
          + "Namespace"   = "bb-apps-devstg-frontend"
          + "Stage"       = "dev"
          + "Terraform"   = "true"
        }
      + tags_all                    = {
          + "Attributes"  = "logs"
          + "Environment" = "apps-devstg"
          + "Name"        = "devstg.aws.binbash.com.ar"
          + "Namespace"   = "bb-apps-devstg-frontend"
          + "Stage"       = "dev"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 5
          + enabled                                = true
          + id                                     = "bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-logs"

          + expiration {
              + days = 90
            }

          + noncurrent_version_expiration {
              + days = 90
            }

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "GLACIER"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }
    }

  # module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_ownership_controls.default[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_public_access_block.default[0] will be created
  + resource "aws_s3_bucket_public_access_block" "default" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.dev_aws_binbash_com_ar.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
  + resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
      + create_duration  = "30s"
      + destroy_duration = "30s"
      + id               = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket.default,
│   on .terraform/modules/dev_aws_binbash_com_ar.logs/main.tf line 1, in resource "aws_s3_bucket" "default":
│    1: resource "aws_s3_bucket" "default" {
│
│ Use the aws_s3_bucket_server_side_encryption_configuration resource instead
│
│ (and 18 more similar warnings elsewhere)
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.dev_aws_binbash_com_ar.aws_cloudfront_origin_access_identity.default[0]: Creating...
module.dev_aws_binbash_com_ar.aws_s3_bucket.origin[0]: Creating...
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket.default[0]: Creating...
module.dev_aws_binbash_com_ar.aws_cloudfront_origin_access_identity.default[0]: Creation complete after 3s [id=XXXXXXXXXXXX]
module.dev_aws_binbash_com_ar.aws_s3_bucket.origin[0]: Still creating... [10s elapsed]
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket.default[0]: Still creating... [10s elapsed]
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket.default[0]: Creation complete after 17s [id=bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-logs]
module.dev_aws_binbash_com_ar.module.logs.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.dev_aws_binbash_com_ar.module.logs.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=XXXXXXXXX]
module.dev_aws_binbash_com_ar.module.logs.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_public_access_block.default[0]: Creating...
module.dev_aws_binbash_com_ar.module.logs.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=3XXXXXXXX]
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_public_access_block.default[0]: Creation complete after 2s [id=bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-logs]
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_policy.default[0]: Creating...
module.dev_aws_binbash_com_ar.aws_s3_bucket.origin[0]: Creation complete after 19s [id=bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin]
module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.s3_ssl_only[0]: Reading...
module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.s3_origin[0]: Reading...
module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.s3_origin[0]: Read complete after 0s [id=XXXXXXX]
module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.s3_ssl_only[0]: Read complete after 0s [id=XXXXXXX]
module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.combined[0]: Reading...
module.dev_aws_binbash_com_ar.data.aws_iam_policy_document.combined[0]: Read complete after 1s [id=XXXXXXXX]
module.dev_aws_binbash_com_ar.aws_s3_bucket_policy.default[0]: Creating...
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Creating...
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_policy.default[0]: Creation complete after 1s [id=bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-logs]
module.dev_aws_binbash_com_ar.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0]: Creating...
module.dev_aws_binbash_com_ar.aws_s3_bucket_policy.default[0]: Creation complete after 1s [id=bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin]
module.dev_aws_binbash_com_ar.time_sleep.wait_for_aws_s3_bucket_settings[0]: Creating...
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [10s elapsed]
module.dev_aws_binbash_com_ar.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0]: Still creating... [10s elapsed]
module.dev_aws_binbash_com_ar.time_sleep.wait_for_aws_s3_bucket_settings[0]: Still creating... [10s elapsed]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [20s elapsed]
module.dev_aws_binbash_com_ar.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0]: Still creating... [20s elapsed]
module.dev_aws_binbash_com_ar.time_sleep.wait_for_aws_s3_bucket_settings[0]: Still creating... [20s elapsed]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [30s elapsed]
module.dev_aws_binbash_com_ar.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0]: Still creating... [30s elapsed]
module.dev_aws_binbash_com_ar.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0]: Creation complete after 30s [id=2022-07-15T16:13:53Z]
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_ownership_controls.default[0]: Creating...
module.dev_aws_binbash_com_ar.time_sleep.wait_for_aws_s3_bucket_settings[0]: Creation complete after 30s [id=2022-07-15T16:13:53Z]
module.dev_aws_binbash_com_ar.aws_s3_bucket_ownership_controls.origin[0]: Creating...
module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket_ownership_controls.default[0]: Creation complete after 2s [id=bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-logs]
module.dev_aws_binbash_com_ar.aws_s3_bucket_ownership_controls.origin[0]: Creation complete after 2s [id=bb-apps-devstg-frontend-dev-devstgawsbinbashcomar-origin]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [40s elapsed]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [50s elapsed]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [1m0s elapsed]
.
.
.
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [2m49s elapsed]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [2m59s elapsed]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Still creating... [3m9s elapsed]
module.dev_aws_binbash_com_ar.aws_cloudfront_distribution.default[0]: Creation complete after 3m15s [id=XXXXXXXXX]
aws_route53_record.priv_oring_dev_aws_binbash_com_ar: Creating...
aws_route53_record.priv_oring_dev_aws_binbash_com_ar: Still creating... [10s elapsed]
aws_route53_record.priv_oring_dev_aws_binbash_com_ar: Still creating... [20s elapsed]
.
.
.
aws_route53_record.priv_oring_dev_aws_binbash_com_ar: Still creating... [50s elapsed]
aws_route53_record.priv_oring_dev_aws_binbash_com_ar: Still creating... [1m0s elapsed]
aws_route53_record.priv_oring_dev_aws_binbash_com_ar: Creation complete after 1m1s [id=Z0XXXXXXXXXXXXXXXXPDJ_dev.devstg.aws.binbash.com.ar_A]
╷
│ Warning: Argument is deprecated
│
│   with module.dev_aws_binbash_com_ar.module.logs.aws_s3_bucket.default[0],
│   on .terraform/modules/dev_aws_binbash_com_ar.logs/main.tf line 1, in resource "aws_s3_bucket" "default":
│    1: resource "aws_s3_bucket" "default" {
│
│ Use the aws_s3_bucket_versioning resource instead
│
│ (and 7 more similar warnings elsewhere)
╵
Releasing state lock. This may take a few moments...

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.
```
